vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/supc.h
/*
 * Component description for SUPC
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_SUPC_COMPONENT_H_
#define _PIC32CMPL10_SUPC_COMPONENT_H_

#if !defined(DISABLE_CMSIS)
#include "core_cm0plus.h"
#endif /* !defined(DISABLE_CMSIS) */

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR SUPC                      */
/* ************************************************************************** */

/* -------- SUPC_INTENCLR : (SUPC Offset: 0x04) (R/W 32) Interrupt Enable Clear -------- */
#define SUPC_INTENCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (SUPC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SUPC_INTENCLR_BODVDDRDY_Pos           _UINT32_(0)                                          /* (SUPC_INTENCLR) BODVDD Ready Interrupt Enable Position */
#define SUPC_INTENCLR_BODVDDRDY_Msk           (_UINT32_(0x1) << SUPC_INTENCLR_BODVDDRDY_Pos)       /* (SUPC_INTENCLR) BODVDD Ready Interrupt Enable Mask */
#define SUPC_INTENCLR_BODVDDRDY(value)        (SUPC_INTENCLR_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_INTENCLR_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_VLM_Pos                 _UINT32_(3)                                          /* (SUPC_INTENCLR) Voltage Level Monitor Interrupt Enable Position */
#define SUPC_INTENCLR_VLM_Msk                 (_UINT32_(0x1) << SUPC_INTENCLR_VLM_Pos)             /* (SUPC_INTENCLR) Voltage Level Monitor Interrupt Enable Mask */
#define SUPC_INTENCLR_VLM(value)              (SUPC_INTENCLR_VLM_Msk & (_UINT32_(value) << SUPC_INTENCLR_VLM_Pos)) /* Assignment of value for VLM in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_VDDIO2OK_Pos            _UINT32_(4)                                          /* (SUPC_INTENCLR) VDDIO2OK Interrupt Enable Position */
#define SUPC_INTENCLR_VDDIO2OK_Msk            (_UINT32_(0x1) << SUPC_INTENCLR_VDDIO2OK_Pos)        /* (SUPC_INTENCLR) VDDIO2OK Interrupt Enable Mask */
#define SUPC_INTENCLR_VDDIO2OK(value)         (SUPC_INTENCLR_VDDIO2OK_Msk & (_UINT32_(value) << SUPC_INTENCLR_VDDIO2OK_Pos)) /* Assignment of value for VDDIO2OK in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_VDDIO2LPMPOR_Pos        _UINT32_(5)                                          /* (SUPC_INTENCLR) VDDIO2 Low-Power Mode POR Interrupt Enable Position */
#define SUPC_INTENCLR_VDDIO2LPMPOR_Msk        (_UINT32_(0x1) << SUPC_INTENCLR_VDDIO2LPMPOR_Pos)    /* (SUPC_INTENCLR) VDDIO2 Low-Power Mode POR Interrupt Enable Mask */
#define SUPC_INTENCLR_VDDIO2LPMPOR(value)     (SUPC_INTENCLR_VDDIO2LPMPOR_Msk & (_UINT32_(value) << SUPC_INTENCLR_VDDIO2LPMPOR_Pos)) /* Assignment of value for VDDIO2LPMPOR in the SUPC_INTENCLR register */
#define SUPC_INTENCLR_Msk                     _UINT32_(0x00000039)                                 /* (SUPC_INTENCLR) Register Mask  */


/* -------- SUPC_INTENSET : (SUPC Offset: 0x08) (R/W 32) Interrupt Enable Set -------- */
#define SUPC_INTENSET_RESETVALUE              _UINT32_(0x00)                                       /*  (SUPC_INTENSET) Interrupt Enable Set  Reset Value */

#define SUPC_INTENSET_BODVDDRDY_Pos           _UINT32_(0)                                          /* (SUPC_INTENSET) BODVDD Ready Interrupt Enable Position */
#define SUPC_INTENSET_BODVDDRDY_Msk           (_UINT32_(0x1) << SUPC_INTENSET_BODVDDRDY_Pos)       /* (SUPC_INTENSET) BODVDD Ready Interrupt Enable Mask */
#define SUPC_INTENSET_BODVDDRDY(value)        (SUPC_INTENSET_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_INTENSET_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_INTENSET register */
#define SUPC_INTENSET_VLM_Pos                 _UINT32_(3)                                          /* (SUPC_INTENSET) Voltage Level Monitor Interrupt Enable Position */
#define SUPC_INTENSET_VLM_Msk                 (_UINT32_(0x1) << SUPC_INTENSET_VLM_Pos)             /* (SUPC_INTENSET) Voltage Level Monitor Interrupt Enable Mask */
#define SUPC_INTENSET_VLM(value)              (SUPC_INTENSET_VLM_Msk & (_UINT32_(value) << SUPC_INTENSET_VLM_Pos)) /* Assignment of value for VLM in the SUPC_INTENSET register */
#define SUPC_INTENSET_VDDIO2OK_Pos            _UINT32_(4)                                          /* (SUPC_INTENSET) VDDIO2 OK Interrupt Enable Position */
#define SUPC_INTENSET_VDDIO2OK_Msk            (_UINT32_(0x1) << SUPC_INTENSET_VDDIO2OK_Pos)        /* (SUPC_INTENSET) VDDIO2 OK Interrupt Enable Mask */
#define SUPC_INTENSET_VDDIO2OK(value)         (SUPC_INTENSET_VDDIO2OK_Msk & (_UINT32_(value) << SUPC_INTENSET_VDDIO2OK_Pos)) /* Assignment of value for VDDIO2OK in the SUPC_INTENSET register */
#define SUPC_INTENSET_VDDIO2LPMPOR_Pos        _UINT32_(5)                                          /* (SUPC_INTENSET) VDDIO2 Low Power Mode POR Interrupt Enable Position */
#define SUPC_INTENSET_VDDIO2LPMPOR_Msk        (_UINT32_(0x1) << SUPC_INTENSET_VDDIO2LPMPOR_Pos)    /* (SUPC_INTENSET) VDDIO2 Low Power Mode POR Interrupt Enable Mask */
#define SUPC_INTENSET_VDDIO2LPMPOR(value)     (SUPC_INTENSET_VDDIO2LPMPOR_Msk & (_UINT32_(value) << SUPC_INTENSET_VDDIO2LPMPOR_Pos)) /* Assignment of value for VDDIO2LPMPOR in the SUPC_INTENSET register */
#define SUPC_INTENSET_Msk                     _UINT32_(0x00000039)                                 /* (SUPC_INTENSET) Register Mask  */


/* -------- SUPC_INTFLAG : (SUPC Offset: 0x0C) (R/W 32) Interrupt Flag Status and Clear -------- */
#define SUPC_INTFLAG_BODVDDRDY_Pos            _UINT32_(0)                                          /* (SUPC_INTFLAG) BODVDD Ready Position */
#define SUPC_INTFLAG_BODVDDRDY_Msk            (_UINT32_(0x1) << SUPC_INTFLAG_BODVDDRDY_Pos)        /* (SUPC_INTFLAG) BODVDD Ready Mask */
#define SUPC_INTFLAG_BODVDDRDY(value)         (SUPC_INTFLAG_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_INTFLAG_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_VLM_Pos                  _UINT32_(3)                                          /* (SUPC_INTFLAG) Voltage Level Monitor Position */
#define SUPC_INTFLAG_VLM_Msk                  (_UINT32_(0x1) << SUPC_INTFLAG_VLM_Pos)              /* (SUPC_INTFLAG) Voltage Level Monitor Mask */
#define SUPC_INTFLAG_VLM(value)               (SUPC_INTFLAG_VLM_Msk & (_UINT32_(value) << SUPC_INTFLAG_VLM_Pos)) /* Assignment of value for VLM in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_VDDIO2OK_Pos             _UINT32_(4)                                          /* (SUPC_INTFLAG) VDDIO2 OK Position */
#define SUPC_INTFLAG_VDDIO2OK_Msk             (_UINT32_(0x1) << SUPC_INTFLAG_VDDIO2OK_Pos)         /* (SUPC_INTFLAG) VDDIO2 OK Mask */
#define SUPC_INTFLAG_VDDIO2OK(value)          (SUPC_INTFLAG_VDDIO2OK_Msk & (_UINT32_(value) << SUPC_INTFLAG_VDDIO2OK_Pos)) /* Assignment of value for VDDIO2OK in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_VDDIO2LPMPOR_Pos         _UINT32_(5)                                          /* (SUPC_INTFLAG) VDDIO2 Low Power Mode POR Position */
#define SUPC_INTFLAG_VDDIO2LPMPOR_Msk         (_UINT32_(0x1) << SUPC_INTFLAG_VDDIO2LPMPOR_Pos)     /* (SUPC_INTFLAG) VDDIO2 Low Power Mode POR Mask */
#define SUPC_INTFLAG_VDDIO2LPMPOR(value)      (SUPC_INTFLAG_VDDIO2LPMPOR_Msk & (_UINT32_(value) << SUPC_INTFLAG_VDDIO2LPMPOR_Pos)) /* Assignment of value for VDDIO2LPMPOR in the SUPC_INTFLAG register */
#define SUPC_INTFLAG_Msk                      _UINT32_(0x00000039)                                 /* (SUPC_INTFLAG) Register Mask  */


