vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/supc.h
/* -------- SUPC_INTFLAGSET : (SUPC Offset: 0x10) (R/W 32) Interrupt Flag Software Set -------- */
#define SUPC_INTFLAGSET_RESETVALUE            _UINT32_(0x00)                                       /*  (SUPC_INTFLAGSET) Interrupt Flag Software Set  Reset Value */

#define SUPC_INTFLAGSET_BODVDDRDY_Pos         _UINT32_(0)                                          /* (SUPC_INTFLAGSET) BODVDD Ready Position */
#define SUPC_INTFLAGSET_BODVDDRDY_Msk         (_UINT32_(0x1) << SUPC_INTFLAGSET_BODVDDRDY_Pos)     /* (SUPC_INTFLAGSET) BODVDD Ready Mask */
#define SUPC_INTFLAGSET_BODVDDRDY(value)      (SUPC_INTFLAGSET_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_INTFLAGSET_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_INTFLAGSET register */
#define SUPC_INTFLAGSET_VLM_Pos               _UINT32_(3)                                          /* (SUPC_INTFLAGSET) Voltage Level Monitor Position */
#define SUPC_INTFLAGSET_VLM_Msk               (_UINT32_(0x1) << SUPC_INTFLAGSET_VLM_Pos)           /* (SUPC_INTFLAGSET) Voltage Level Monitor Mask */
#define SUPC_INTFLAGSET_VLM(value)            (SUPC_INTFLAGSET_VLM_Msk & (_UINT32_(value) << SUPC_INTFLAGSET_VLM_Pos)) /* Assignment of value for VLM in the SUPC_INTFLAGSET register */
#define SUPC_INTFLAGSET_VDDIO2OK_Pos          _UINT32_(4)                                          /* (SUPC_INTFLAGSET) VDDIO2 OK Position */
#define SUPC_INTFLAGSET_VDDIO2OK_Msk          (_UINT32_(0x1) << SUPC_INTFLAGSET_VDDIO2OK_Pos)      /* (SUPC_INTFLAGSET) VDDIO2 OK Mask */
#define SUPC_INTFLAGSET_VDDIO2OK(value)       (SUPC_INTFLAGSET_VDDIO2OK_Msk & (_UINT32_(value) << SUPC_INTFLAGSET_VDDIO2OK_Pos)) /* Assignment of value for VDDIO2OK in the SUPC_INTFLAGSET register */
#define SUPC_INTFLAGSET_VDDIO2LPMPOR_Pos      _UINT32_(5)                                          /* (SUPC_INTFLAGSET) VDDIO2 Low Power Mode POR Position */
#define SUPC_INTFLAGSET_VDDIO2LPMPOR_Msk      (_UINT32_(0x1) << SUPC_INTFLAGSET_VDDIO2LPMPOR_Pos)  /* (SUPC_INTFLAGSET) VDDIO2 Low Power Mode POR Mask */
#define SUPC_INTFLAGSET_VDDIO2LPMPOR(value)   (SUPC_INTFLAGSET_VDDIO2LPMPOR_Msk & (_UINT32_(value) << SUPC_INTFLAGSET_VDDIO2LPMPOR_Pos)) /* Assignment of value for VDDIO2LPMPOR in the SUPC_INTFLAGSET register */
#define SUPC_INTFLAGSET_Msk                   _UINT32_(0x00000039)                                 /* (SUPC_INTFLAGSET) Register Mask  */


/* -------- SUPC_STATUS : (SUPC Offset: 0x14) ( R/ 32) Status -------- */
#define SUPC_STATUS_BODVDDRDY_Pos             _UINT32_(0)                                          /* (SUPC_STATUS) BODVDD Ready Position */
#define SUPC_STATUS_BODVDDRDY_Msk             (_UINT32_(0x1) << SUPC_STATUS_BODVDDRDY_Pos)         /* (SUPC_STATUS) BODVDD Ready Mask */
#define SUPC_STATUS_BODVDDRDY(value)          (SUPC_STATUS_BODVDDRDY_Msk & (_UINT32_(value) << SUPC_STATUS_BODVDDRDY_Pos)) /* Assignment of value for BODVDDRDY in the SUPC_STATUS register */
#define SUPC_STATUS_VLM_Pos                   _UINT32_(3)                                          /* (SUPC_STATUS) Voltage Level Monitor Position */
#define SUPC_STATUS_VLM_Msk                   (_UINT32_(0x1) << SUPC_STATUS_VLM_Pos)               /* (SUPC_STATUS) Voltage Level Monitor Mask */
#define SUPC_STATUS_VLM(value)                (SUPC_STATUS_VLM_Msk & (_UINT32_(value) << SUPC_STATUS_VLM_Pos)) /* Assignment of value for VLM in the SUPC_STATUS register */
#define SUPC_STATUS_VDDIO2OK_Pos              _UINT32_(4)                                          /* (SUPC_STATUS) VDDIO2 OK Position */
#define SUPC_STATUS_VDDIO2OK_Msk              (_UINT32_(0x1) << SUPC_STATUS_VDDIO2OK_Pos)          /* (SUPC_STATUS) VDDIO2 OK Mask */
#define SUPC_STATUS_VDDIO2OK(value)           (SUPC_STATUS_VDDIO2OK_Msk & (_UINT32_(value) << SUPC_STATUS_VDDIO2OK_Pos)) /* Assignment of value for VDDIO2OK in the SUPC_STATUS register */
#define SUPC_STATUS_VDDIO2LPMPOR_Pos          _UINT32_(5)                                          /* (SUPC_STATUS) VDDIO2 Low Power Mode POR Position */
#define SUPC_STATUS_VDDIO2LPMPOR_Msk          (_UINT32_(0x1) << SUPC_STATUS_VDDIO2LPMPOR_Pos)      /* (SUPC_STATUS) VDDIO2 Low Power Mode POR Mask */
#define SUPC_STATUS_VDDIO2LPMPOR(value)       (SUPC_STATUS_VDDIO2LPMPOR_Msk & (_UINT32_(value) << SUPC_STATUS_VDDIO2LPMPOR_Pos)) /* Assignment of value for VDDIO2LPMPOR in the SUPC_STATUS register */
#define SUPC_STATUS_Msk                       _UINT32_(0x00000039)                                 /* (SUPC_STATUS) Register Mask  */


/* -------- SUPC_BODVDD : (SUPC Offset: 0x1C) (R/W 32) VDD Brown-Out Detector Control -------- */
#define SUPC_BODVDD_RESETVALUE                _UINT32_(0x00)                                       /*  (SUPC_BODVDD) VDD Brown-Out Detector Control  Reset Value */

#define SUPC_BODVDD_ENABLE_Pos                _UINT32_(1)                                          /* (SUPC_BODVDD) Enable Position */
#define SUPC_BODVDD_ENABLE_Msk                (_UINT32_(0x1) << SUPC_BODVDD_ENABLE_Pos)            /* (SUPC_BODVDD) Enable Mask */
#define SUPC_BODVDD_ENABLE(value)             (SUPC_BODVDD_ENABLE_Msk & (_UINT32_(value) << SUPC_BODVDD_ENABLE_Pos)) /* Assignment of value for ENABLE in the SUPC_BODVDD register */
#define SUPC_BODVDD_STDBYCFG_Pos              _UINT32_(5)                                          /* (SUPC_BODVDD) BOD Configuration in Standby Sleep Mode Position */
#define SUPC_BODVDD_STDBYCFG_Msk              (_UINT32_(0x1) << SUPC_BODVDD_STDBYCFG_Pos)          /* (SUPC_BODVDD) BOD Configuration in Standby Sleep Mode Mask */
#define SUPC_BODVDD_STDBYCFG(value)           (SUPC_BODVDD_STDBYCFG_Msk & (_UINT32_(value) << SUPC_BODVDD_STDBYCFG_Pos)) /* Assignment of value for STDBYCFG in the SUPC_BODVDD register */
#define   SUPC_BODVDD_STDBYCFG_CONT_Val       _UINT32_(0x0)                                        /* (SUPC_BODVDD) Continuous Mode  */
#define   SUPC_BODVDD_STDBYCFG_SAMP_Val       _UINT32_(0x1)                                        /* (SUPC_BODVDD) Sampling Mode  */
#define SUPC_BODVDD_STDBYCFG_CONT             (SUPC_BODVDD_STDBYCFG_CONT_Val << SUPC_BODVDD_STDBYCFG_Pos) /* (SUPC_BODVDD) Continuous Mode Position */
#define SUPC_BODVDD_STDBYCFG_SAMP             (SUPC_BODVDD_STDBYCFG_SAMP_Val << SUPC_BODVDD_STDBYCFG_Pos) /* (SUPC_BODVDD) Sampling Mode Position */
#define SUPC_BODVDD_RUNSTDBY_Pos              _UINT32_(6)                                          /* (SUPC_BODVDD) Run in Standby Position */
#define SUPC_BODVDD_RUNSTDBY_Msk              (_UINT32_(0x1) << SUPC_BODVDD_RUNSTDBY_Pos)          /* (SUPC_BODVDD) Run in Standby Mask */
#define SUPC_BODVDD_RUNSTDBY(value)           (SUPC_BODVDD_RUNSTDBY_Msk & (_UINT32_(value) << SUPC_BODVDD_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SUPC_BODVDD register */
#define SUPC_BODVDD_ACTCFG_Pos                _UINT32_(8)                                          /* (SUPC_BODVDD) BOD Configuration in Active Mode Position */
#define SUPC_BODVDD_ACTCFG_Msk                (_UINT32_(0x1) << SUPC_BODVDD_ACTCFG_Pos)            /* (SUPC_BODVDD) BOD Configuration in Active Mode Mask */
#define SUPC_BODVDD_ACTCFG(value)             (SUPC_BODVDD_ACTCFG_Msk & (_UINT32_(value) << SUPC_BODVDD_ACTCFG_Pos)) /* Assignment of value for ACTCFG in the SUPC_BODVDD register */
#define   SUPC_BODVDD_ACTCFG_CONT_Val         _UINT32_(0x0)                                        /* (SUPC_BODVDD) Continuous Mode  */
#define   SUPC_BODVDD_ACTCFG_SAMP_Val         _UINT32_(0x1)                                        /* (SUPC_BODVDD) Sampling Mode  */
#define SUPC_BODVDD_ACTCFG_CONT               (SUPC_BODVDD_ACTCFG_CONT_Val << SUPC_BODVDD_ACTCFG_Pos) /* (SUPC_BODVDD) Continuous Mode Position */
#define SUPC_BODVDD_ACTCFG_SAMP               (SUPC_BODVDD_ACTCFG_SAMP_Val << SUPC_BODVDD_ACTCFG_Pos) /* (SUPC_BODVDD) Sampling Mode Position */
#define SUPC_BODVDD_SAMPFREQ_Pos              _UINT32_(12)                                         /* (SUPC_BODVDD) Sampling Frequency Position */
#define SUPC_BODVDD_SAMPFREQ_Msk              (_UINT32_(0x1) << SUPC_BODVDD_SAMPFREQ_Pos)          /* (SUPC_BODVDD) Sampling Frequency Mask */
#define SUPC_BODVDD_SAMPFREQ(value)           (SUPC_BODVDD_SAMPFREQ_Msk & (_UINT32_(value) << SUPC_BODVDD_SAMPFREQ_Pos)) /* Assignment of value for SAMPFREQ in the SUPC_BODVDD register */
#define   SUPC_BODVDD_SAMPFREQ_128HZ_Val      _UINT32_(0x0)                                        /* (SUPC_BODVDD) 128 Hz Sampling Frequency  */
#define   SUPC_BODVDD_SAMPFREQ_32HZ_Val       _UINT32_(0x1)                                        /* (SUPC_BODVDD) 32 Hz Sampling Frequency  */
#define SUPC_BODVDD_SAMPFREQ_128HZ            (SUPC_BODVDD_SAMPFREQ_128HZ_Val << SUPC_BODVDD_SAMPFREQ_Pos) /* (SUPC_BODVDD) 128 Hz Sampling Frequency Position */
#define SUPC_BODVDD_SAMPFREQ_32HZ             (SUPC_BODVDD_SAMPFREQ_32HZ_Val << SUPC_BODVDD_SAMPFREQ_Pos) /* (SUPC_BODVDD) 32 Hz Sampling Frequency Position */
#define SUPC_BODVDD_LEVEL_Pos                 _UINT32_(16)                                         /* (SUPC_BODVDD) BOD Level Position */
#define SUPC_BODVDD_LEVEL_Msk                 (_UINT32_(0x3) << SUPC_BODVDD_LEVEL_Pos)             /* (SUPC_BODVDD) BOD Level Mask */
#define SUPC_BODVDD_LEVEL(value)              (SUPC_BODVDD_LEVEL_Msk & (_UINT32_(value) << SUPC_BODVDD_LEVEL_Pos)) /* Assignment of value for LEVEL in the SUPC_BODVDD register */
#define   SUPC_BODVDD_LEVEL_BODLEVEL0_Val     _UINT32_(0x0)                                        /* (SUPC_BODVDD) 1.90V  */
#define   SUPC_BODVDD_LEVEL_BODLEVEL1_Val     _UINT32_(0x1)                                        /* (SUPC_BODVDD) 2.45V  */
#define   SUPC_BODVDD_LEVEL_BODLEVEL2_Val     _UINT32_(0x2)                                        /* (SUPC_BODVDD) 2.70V  */
#define   SUPC_BODVDD_LEVEL_BODLEVEL3_Val     _UINT32_(0x3)                                        /* (SUPC_BODVDD) 2.85V  */
#define SUPC_BODVDD_LEVEL_BODLEVEL0           (SUPC_BODVDD_LEVEL_BODLEVEL0_Val << SUPC_BODVDD_LEVEL_Pos) /* (SUPC_BODVDD) 1.90V Position */
#define SUPC_BODVDD_LEVEL_BODLEVEL1           (SUPC_BODVDD_LEVEL_BODLEVEL1_Val << SUPC_BODVDD_LEVEL_Pos) /* (SUPC_BODVDD) 2.45V Position */
#define SUPC_BODVDD_LEVEL_BODLEVEL2           (SUPC_BODVDD_LEVEL_BODLEVEL2_Val << SUPC_BODVDD_LEVEL_Pos) /* (SUPC_BODVDD) 2.70V Position */
#define SUPC_BODVDD_LEVEL_BODLEVEL3           (SUPC_BODVDD_LEVEL_BODLEVEL3_Val << SUPC_BODVDD_LEVEL_Pos) /* (SUPC_BODVDD) 2.85V Position */
#define SUPC_BODVDD_VLMLVL_Pos                _UINT32_(24)                                         /* (SUPC_BODVDD) Voltage Level Monitor Level Position */
#define SUPC_BODVDD_VLMLVL_Msk                (_UINT32_(0x3) << SUPC_BODVDD_VLMLVL_Pos)            /* (SUPC_BODVDD) Voltage Level Monitor Level Mask */
#define SUPC_BODVDD_VLMLVL(value)             (SUPC_BODVDD_VLMLVL_Msk & (_UINT32_(value) << SUPC_BODVDD_VLMLVL_Pos)) /* Assignment of value for VLMLVL in the SUPC_BODVDD register */
#define   SUPC_BODVDD_VLMLVL_OFF_Val          _UINT32_(0x0)                                        /* (SUPC_BODVDD) VLM is disabled  */
#define   SUPC_BODVDD_VLMLVL_5ABOVE_Val       _UINT32_(0x1)                                        /* (SUPC_BODVDD) The VLM threshold is 5% above the BOD threshold  */
#define   SUPC_BODVDD_VLMLVL_15ABOVE_Val      _UINT32_(0x2)                                        /* (SUPC_BODVDD) The VLM threshold is 15% above the BOD threshold  */
#define   SUPC_BODVDD_VLMLVL_25ABOVE_Val      _UINT32_(0x3)                                        /* (SUPC_BODVDD) The VLM threshold is 25% above the BOD threshold  */
#define SUPC_BODVDD_VLMLVL_OFF                (SUPC_BODVDD_VLMLVL_OFF_Val << SUPC_BODVDD_VLMLVL_Pos) /* (SUPC_BODVDD) VLM is disabled Position */
#define SUPC_BODVDD_VLMLVL_5ABOVE             (SUPC_BODVDD_VLMLVL_5ABOVE_Val << SUPC_BODVDD_VLMLVL_Pos) /* (SUPC_BODVDD) The VLM threshold is 5% above the BOD threshold Position */
#define SUPC_BODVDD_VLMLVL_15ABOVE            (SUPC_BODVDD_VLMLVL_15ABOVE_Val << SUPC_BODVDD_VLMLVL_Pos) /* (SUPC_BODVDD) The VLM threshold is 15% above the BOD threshold Position */
#define SUPC_BODVDD_VLMLVL_25ABOVE            (SUPC_BODVDD_VLMLVL_25ABOVE_Val << SUPC_BODVDD_VLMLVL_Pos) /* (SUPC_BODVDD) The VLM threshold is 25% above the BOD threshold Position */
#define SUPC_BODVDD_VLMCFG_Pos                _UINT32_(26)                                         /* (SUPC_BODVDD) Voltage Level Monitor Interrupt Configuration Position */
#define SUPC_BODVDD_VLMCFG_Msk                (_UINT32_(0x3) << SUPC_BODVDD_VLMCFG_Pos)            /* (SUPC_BODVDD) Voltage Level Monitor Interrupt Configuration Mask */
#define SUPC_BODVDD_VLMCFG(value)             (SUPC_BODVDD_VLMCFG_Msk & (_UINT32_(value) << SUPC_BODVDD_VLMCFG_Pos)) /* Assignment of value for VLMCFG in the SUPC_BODVDD register */
#define   SUPC_BODVDD_VLMCFG_FALLING_Val      _UINT32_(0x0)                                        /* (SUPC_BODVDD) VDD falls below the VLM threshold  */
#define   SUPC_BODVDD_VLMCFG_RISING_Val       _UINT32_(0x1)                                        /* (SUPC_BODVDD) VDD rises above the VLM threshold  */
#define   SUPC_BODVDD_VLMCFG_BOTH_Val         _UINT32_(0x2)                                        /* (SUPC_BODVDD) VDD crosses the VLM threshold  */
#define SUPC_BODVDD_VLMCFG_FALLING            (SUPC_BODVDD_VLMCFG_FALLING_Val << SUPC_BODVDD_VLMCFG_Pos) /* (SUPC_BODVDD) VDD falls below the VLM threshold Position */
#define SUPC_BODVDD_VLMCFG_RISING             (SUPC_BODVDD_VLMCFG_RISING_Val << SUPC_BODVDD_VLMCFG_Pos) /* (SUPC_BODVDD) VDD rises above the VLM threshold Position */
#define SUPC_BODVDD_VLMCFG_BOTH               (SUPC_BODVDD_VLMCFG_BOTH_Val << SUPC_BODVDD_VLMCFG_Pos) /* (SUPC_BODVDD) VDD crosses the VLM threshold Position */
#define SUPC_BODVDD_WRTLOCK_Pos               _UINT32_(31)                                         /* (SUPC_BODVDD) Write Lock Position */
#define SUPC_BODVDD_WRTLOCK_Msk               (_UINT32_(0x1) << SUPC_BODVDD_WRTLOCK_Pos)           /* (SUPC_BODVDD) Write Lock Mask */
#define SUPC_BODVDD_WRTLOCK(value)            (SUPC_BODVDD_WRTLOCK_Msk & (_UINT32_(value) << SUPC_BODVDD_WRTLOCK_Pos)) /* Assignment of value for WRTLOCK in the SUPC_BODVDD register */
#define SUPC_BODVDD_Msk                       _UINT32_(0x8F031162)                                 /* (SUPC_BODVDD) Register Mask  */


/* -------- SUPC_VREG : (SUPC Offset: 0x20) (R/W 32) Voltage Regulator Control -------- */
#define SUPC_VREG_RESETVALUE                  _UINT32_(0x00)                                       /*  (SUPC_VREG) Voltage Regulator Control  Reset Value */

#define SUPC_VREG_RUNSTDBY_Pos                _UINT32_(6)                                          /* (SUPC_VREG) Run in Standby Position */
#define SUPC_VREG_RUNSTDBY_Msk                (_UINT32_(0x1) << SUPC_VREG_RUNSTDBY_Pos)            /* (SUPC_VREG) Run in Standby Mask */
#define SUPC_VREG_RUNSTDBY(value)             (SUPC_VREG_RUNSTDBY_Msk & (_UINT32_(value) << SUPC_VREG_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SUPC_VREG register */
#define SUPC_VREG_Msk                         _UINT32_(0x00000040)                                 /* (SUPC_VREG) Register Mask  */


