vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/supc.h
/* -------- SUPC_MVIO : (SUPC Offset: 0x24) (R/W 32) MVIO Control -------- */
#define SUPC_MVIO_RESETVALUE                  _UINT32_(0x00)                                       /*  (SUPC_MVIO) MVIO Control  Reset Value */

#define SUPC_MVIO_MODE_Pos                    _UINT32_(0)                                          /* (SUPC_MVIO) Operation Mode Position */
#define SUPC_MVIO_MODE_Msk                    (_UINT32_(0x1) << SUPC_MVIO_MODE_Pos)                /* (SUPC_MVIO) Operation Mode Mask */
#define SUPC_MVIO_MODE(value)                 (SUPC_MVIO_MODE_Msk & (_UINT32_(value) << SUPC_MVIO_MODE_Pos)) /* Assignment of value for MODE in the SUPC_MVIO register */
#define   SUPC_MVIO_MODE_DUAL_Val             _UINT32_(0x0)                                        /* (SUPC_MVIO) MVIO operating in dual supply mode  */
#define   SUPC_MVIO_MODE_SINGLE_Val           _UINT32_(0x1)                                        /* (SUPC_MVIO) MVIO operating in Single supply mode  */
#define SUPC_MVIO_MODE_DUAL                   (SUPC_MVIO_MODE_DUAL_Val << SUPC_MVIO_MODE_Pos)      /* (SUPC_MVIO) MVIO operating in dual supply mode Position */
#define SUPC_MVIO_MODE_SINGLE                 (SUPC_MVIO_MODE_SINGLE_Val << SUPC_MVIO_MODE_Pos)    /* (SUPC_MVIO) MVIO operating in Single supply mode Position */
#define SUPC_MVIO_VDDIO2CFG_Pos               _UINT32_(2)                                          /* (SUPC_MVIO) VDDIO2 Configuration Position */
#define SUPC_MVIO_VDDIO2CFG_Msk               (_UINT32_(0x3) << SUPC_MVIO_VDDIO2CFG_Pos)           /* (SUPC_MVIO) VDDIO2 Configuration Mask */
#define SUPC_MVIO_VDDIO2CFG(value)            (SUPC_MVIO_VDDIO2CFG_Msk & (_UINT32_(value) << SUPC_MVIO_VDDIO2CFG_Pos)) /* Assignment of value for VDDIO2CFG in the SUPC_MVIO register */
#define   SUPC_MVIO_VDDIO2CFG_NORMAL_Val      _UINT32_(0x0)                                        /* (SUPC_MVIO) VDDIO2 with voltage protection enabled  */
#define   SUPC_MVIO_VDDIO2CFG_LOWPOWER_Val    _UINT32_(0x1)                                        /* (SUPC_MVIO) VDDIO2 with voltage protection disabled  */
#define   SUPC_MVIO_VDDIO2CFG_VDDIO2OFF_Val   _UINT32_(0x2)                                        /* (SUPC_MVIO) VDDIO2 domain is disabled. I/O pins are not available.  */
#define SUPC_MVIO_VDDIO2CFG_NORMAL            (SUPC_MVIO_VDDIO2CFG_NORMAL_Val << SUPC_MVIO_VDDIO2CFG_Pos) /* (SUPC_MVIO) VDDIO2 with voltage protection enabled Position */
#define SUPC_MVIO_VDDIO2CFG_LOWPOWER          (SUPC_MVIO_VDDIO2CFG_LOWPOWER_Val << SUPC_MVIO_VDDIO2CFG_Pos) /* (SUPC_MVIO) VDDIO2 with voltage protection disabled Position */
#define SUPC_MVIO_VDDIO2CFG_VDDIO2OFF         (SUPC_MVIO_VDDIO2CFG_VDDIO2OFF_Val << SUPC_MVIO_VDDIO2CFG_Pos) /* (SUPC_MVIO) VDDIO2 domain is disabled. I/O pins are not available. Position */
#define SUPC_MVIO_Msk                         _UINT32_(0x0000000D)                                 /* (SUPC_MVIO) Register Mask  */


/* -------- SUPC_EVCTRL : (SUPC Offset: 0x28) (R/W 32) Event Control -------- */
#define SUPC_EVCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (SUPC_EVCTRL) Event Control  Reset Value */

#define SUPC_EVCTRL_MVIOEO_Pos                _UINT32_(0)                                          /* (SUPC_EVCTRL) MVIO Event Output Enable Position */
#define SUPC_EVCTRL_MVIOEO_Msk                (_UINT32_(0x1) << SUPC_EVCTRL_MVIOEO_Pos)            /* (SUPC_EVCTRL) MVIO Event Output Enable Mask */
#define SUPC_EVCTRL_MVIOEO(value)             (SUPC_EVCTRL_MVIOEO_Msk & (_UINT32_(value) << SUPC_EVCTRL_MVIOEO_Pos)) /* Assignment of value for MVIOEO in the SUPC_EVCTRL register */
#define SUPC_EVCTRL_VLMEO_Pos                 _UINT32_(1)                                          /* (SUPC_EVCTRL) VLM Event Output Enable Position */
#define SUPC_EVCTRL_VLMEO_Msk                 (_UINT32_(0x1) << SUPC_EVCTRL_VLMEO_Pos)             /* (SUPC_EVCTRL) VLM Event Output Enable Mask */
#define SUPC_EVCTRL_VLMEO(value)              (SUPC_EVCTRL_VLMEO_Msk & (_UINT32_(value) << SUPC_EVCTRL_VLMEO_Pos)) /* Assignment of value for VLMEO in the SUPC_EVCTRL register */
#define SUPC_EVCTRL_Msk                       _UINT32_(0x00000003)                                 /* (SUPC_EVCTRL) Register Mask  */


/* -------- SUPC_WPCTRL : (SUPC Offset: 0x2C) (R/W 32) Write Protection Control -------- */
#define SUPC_WPCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (SUPC_WPCTRL) Write Protection Control  Reset Value */

#define SUPC_WPCTRL_WPEN_Pos                  _UINT32_(0)                                          /* (SUPC_WPCTRL) Write Protection Enable Position */
#define SUPC_WPCTRL_WPEN_Msk                  (_UINT32_(0x1) << SUPC_WPCTRL_WPEN_Pos)              /* (SUPC_WPCTRL) Write Protection Enable Mask */
#define SUPC_WPCTRL_WPEN(value)               (SUPC_WPCTRL_WPEN_Msk & (_UINT32_(value) << SUPC_WPCTRL_WPEN_Pos)) /* Assignment of value for WPEN in the SUPC_WPCTRL register */
#define SUPC_WPCTRL_WPLCK_Pos                 _UINT32_(1)                                          /* (SUPC_WPCTRL) Write Protection Lock Position */
#define SUPC_WPCTRL_WPLCK_Msk                 (_UINT32_(0x1) << SUPC_WPCTRL_WPLCK_Pos)             /* (SUPC_WPCTRL) Write Protection Lock Mask */
#define SUPC_WPCTRL_WPLCK(value)              (SUPC_WPCTRL_WPLCK_Msk & (_UINT32_(value) << SUPC_WPCTRL_WPLCK_Pos)) /* Assignment of value for WPLCK in the SUPC_WPCTRL register */
#define SUPC_WPCTRL_WPKEY_Pos                 _UINT32_(8)                                          /* (SUPC_WPCTRL) Write Protection Key Position */
#define SUPC_WPCTRL_WPKEY_Msk                 (_UINT32_(0xFFFFFF) << SUPC_WPCTRL_WPKEY_Pos)        /* (SUPC_WPCTRL) Write Protection Key Mask */
#define SUPC_WPCTRL_WPKEY(value)              (SUPC_WPCTRL_WPKEY_Msk & (_UINT32_(value) << SUPC_WPCTRL_WPKEY_Pos)) /* Assignment of value for WPKEY in the SUPC_WPCTRL register */
#define   SUPC_WPCTRL_WPKEY_KEY_Val           _UINT32_(0x535550)                                   /* (SUPC_WPCTRL) Allows writes to the WPCTRL register  */
#define SUPC_WPCTRL_WPKEY_KEY                 (SUPC_WPCTRL_WPKEY_KEY_Val << SUPC_WPCTRL_WPKEY_Pos) /* (SUPC_WPCTRL) Allows writes to the WPCTRL register Position */
#define SUPC_WPCTRL_Msk                       _UINT32_(0xFFFFFF03)                                 /* (SUPC_WPCTRL) Register Mask  */


/* SUPC register offsets definitions */
#define SUPC_INTENCLR_REG_OFST         _UINT32_(0x04)      /* (SUPC_INTENCLR) Interrupt Enable Clear Offset */
#define SUPC_INTENSET_REG_OFST         _UINT32_(0x08)      /* (SUPC_INTENSET) Interrupt Enable Set Offset */
#define SUPC_INTFLAG_REG_OFST          _UINT32_(0x0C)      /* (SUPC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define SUPC_INTFLAGSET_REG_OFST       _UINT32_(0x10)      /* (SUPC_INTFLAGSET) Interrupt Flag Software Set Offset */
#define SUPC_STATUS_REG_OFST           _UINT32_(0x14)      /* (SUPC_STATUS) Status Offset */
#define SUPC_BODVDD_REG_OFST           _UINT32_(0x1C)      /* (SUPC_BODVDD) VDD Brown-Out Detector Control Offset */
#define SUPC_VREG_REG_OFST             _UINT32_(0x20)      /* (SUPC_VREG) Voltage Regulator Control Offset */
#define SUPC_MVIO_REG_OFST             _UINT32_(0x24)      /* (SUPC_MVIO) MVIO Control Offset */
#define SUPC_EVCTRL_REG_OFST           _UINT32_(0x28)      /* (SUPC_EVCTRL) Event Control Offset */
#define SUPC_WPCTRL_REG_OFST           _UINT32_(0x2C)      /* (SUPC_WPCTRL) Write Protection Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* SUPC register API structure */
typedef struct
{  /* Supply Controller */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       SUPC_INTENCLR;      /* Offset: 0x04 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       SUPC_INTENSET;      /* Offset: 0x08 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       SUPC_INTFLAG;       /* Offset: 0x0C (R/W  32) Interrupt Flag Status and Clear */
  __IO  uint32_t                       SUPC_INTFLAGSET;    /* Offset: 0x10 (R/W  32) Interrupt Flag Software Set */
  __I   uint32_t                       SUPC_STATUS;        /* Offset: 0x14 (R/   32) Status */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       SUPC_BODVDD;        /* Offset: 0x1C (R/W  32) VDD Brown-Out Detector Control */
  __IO  uint32_t                       SUPC_VREG;          /* Offset: 0x20 (R/W  32) Voltage Regulator Control */
  __IO  uint32_t                       SUPC_MVIO;          /* Offset: 0x24 (R/W  32) MVIO Control */
  __IO  uint32_t                       SUPC_EVCTRL;        /* Offset: 0x28 (R/W  32) Event Control */
  __IO  uint32_t                       SUPC_WPCTRL;        /* Offset: 0x2C (R/W  32) Write Protection Control */
} supc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMPL10_SUPC_COMPONENT_H_ */
